cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/services'
tap "universal-ctags/universal-ctags"

brew 'git'
brew 'openssl'
brew 'openssh'
brew 'autoconf'
brew "universal-ctags", args: ["HEAD"]
brew 'openconnect'
brew 'htop'
brew 'ack'
brew 'awscli'
brew 'bash'
brew "asciinema"
brew "mas"
brew 'wget'
brew 'httpie'
brew 'tree'
brew 'gist'
brew 'watch'
brew 'tmux'
brew 'fortune'
brew 'irssi'
brew 'nmap'
brew 'readline'
brew 'heroku'
brew 'postgresql', restart_service: :changed
brew 'redis', restart_service: :changed
brew 'mongodb', restart_service: :changed
brew 'mysql', restart_service: :changed
brew 'sqlite'
brew 'shellcheck'
brew 'hub'
brew 'jq'
brew 'protobuf'
brew 'rabbitmq'
brew "rsync"
brew 'ruby-install'
brew 'kops'
brew 'vim'
brew 'xz'
brew 'z'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'nvm'
brew 'node'
brew 'gnupg'
brew 'tldr'
brew 'the_silver_searcher'
brew 'terraform'
brew 'exercism'
brew 'imagemagick'
brew 'libyaml'
brew 'coreutils'
brew 'yarn'
brew 'screenfetch'
brew 'diff-so-fancy'

cask 'gpg-suite'
cask 'java'
cask 'alfred'
cask 'authy'
cask 'amazon-music'
cask 'spotify'
cask 'google-chrome'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'postman'
cask "ngrok"
cask 'iterm2'
cask 'atom'
cask 'flux'
cask 'karabiner-elements'
cask 'datagrip'
cask 'sequel-pro'
cask 'github'
cask 'ghost'
cask 'plex-media-player'
cask 'mplayerx'

mas "1Password",       id: 443987910
mas "DaisyDisk",       id: 411643860
mas "Divvy",           id: 413857545
mas "Type Fu",         id: 509818877
mas "Pixelmator",      id: 407963104
mas "Slack",           id: 803453959
mas "Xcode",           id: 497799835
