cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/services'
tap 'universal-ctags/universal-ctags'
tap 'heroku/brew'

brew 'asciinema'
brew 'ack'
brew 'autoconf'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'consul'
brew 'coreutils'
brew 'ctop'
brew 'diff-so-fancy'
brew 'docker-machine-driver-xhyve'
brew 'exercism'
brew 'fortune'
brew 'gist'
brew 'git'
brew 'gnupg'
brew 'goreleaser'
brew 'grip'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'irssi'
brew 'jq'
brew 'kops'
brew 'kubectl'
brew 'libyaml'
brew 'logstash'
brew 'mas'
brew 'mysql', restart_service: :changed
brew 'nmap'
brew 'node'
brew 'nvm'
brew 'openconnect'
brew 'openssh'
brew 'openssl'
brew 'postgresql', restart_service: :changed
brew 'protobuf'
brew 'rabbitmq'
brew 'readline'
brew 'redis', restart_service: :changed
brew 'rsync'
brew 'ruby-build'
brew 'ruby-install'
brew 'screenfetch'
brew 'shellcheck'
brew 'sqlite'
brew 'svn'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'universal-ctags', args: ["HEAD"]
brew 'vim'
brew 'watch'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'z'
brew 'zsh'
brew 'zsh-syntax-highlighting'

cask 'alfred'
cask 'atom'
cask 'authy'
cask 'brave-browser'
cask 'dash'
cask 'datagrip'
cask 'docker'
cask 'github'
cask 'gpg-suite'
cask 'iterm2'
cask 'karabiner-elements'
cask 'ngrok'
cask 'postman'
cask 'spotify'

# `mas list` to show mac app store installed apps
# https://github.com/mas-cli/mas
mas '1Password', id: 1333542190
mas 'DaisyDisk', id: 411643860
mas 'Divvy',     id: 413857545
mas 'Slack',     id: 803453959
mas 'Xcode',     id: 497799835
